Repository: zviratko/omlx
Catalog: apps/omlx-mac/Resources/Localizable.xcstrings
Source language: en
Languages: ja, ko, ru, zh_hans, zh_hant

# server.profile.repetition_penalty
source: Repetition Penalty
ru: Repetition-штраф
zh_hans: 重复惩罚

# server.profile.repetition_penalty.sub
source: Penalize repeated tokens.
ru: Штрафовать повторяющиеся токены.
zh_hans: 惩罚重复 Token。

# server.profile.show_all
source: Show all fields…
ru: Показать все поля…
zh_hans: 显示所有字段…

# server.profile.show_fewer
source: Show fewer
ru: Показать меньше
zh_hans: 显示更少

# server.profile.speculative_decoding
source: Speculative decoding
ru: Спекулятивное декодирование
zh_hans: 推测解码

# server.profile.speculative_decoding.note
source: Per-model only — see Models → [model] → Advanced.
ru: Только для модели — см. Модели → [модель] → Дополнительно.
zh_hans: 仅每个模型 — 参见 模型 → [模型] → 高级。

# server.profile.temperature
source: Temperature
ru: Температура
zh_hans: 温度

# server.profile.temperature.sub
source: Sampling randomness (0–2).
ru: Случайность сэмплирования (0–2).
zh_hans: 采样随机性（0–2）。

# server.profile.top_k.sub
source: Limit candidates to top K. 0 = disabled.
ru: Ограничить кандидаты top K. 0 = отключено.
zh_hans: 限制候选为 Top K。0 = 禁用。

# server.profile.top_p.sub
source: Nucleus sampling cutoff (0–1).
ru: Порог nucleus sampling (0–1).
zh_hans: 核心采样截止值（0–1）。

# server.profile.ttl.note
source: Per-model only — see Models → [model] → Basic.
ru: Только для модели — см. Модели → [модель] → Базовые.
zh_hans: 仅每个模型 — 参见 模型 → [模型] → 基础。

# server.row.auto_start_on_launch
source: Automatically start server on launch
ru: Автоматически запускать сервер при старте
zh_hans: 启动时自动启动服务器

# server.row.auto_start_on_launch.sub
source: When disabled, the menu bar app opens without starting the server.
ru: Если отключено, приложение в строке меню открывается без запуска сервера.
zh_hans: 禁用时，菜单栏应用打开时不启动服务器。

# server.row.base_path
source: Base Path
ru: Базовый путь
zh_hans: 基础路径

# server.row.base_path.sub
source: OMLX_BASE_PATH. Files move and the server restarts when this changes.
ru: OMLX_BASE_PATH. При изменении файлы перемещаются, а сервер перезапускается.
zh_hans: OMLX_BASE_PATH。文件移动且服务器在此更改时重启。

# server.row.hf_cache
source: Use Hugging Face local cache
ru: Использовать локальный кэш Hugging Face
zh_hans: 使用 Hugging Face 本地缓存

# server.row.hf_cache.sub
source: Discover MLX-compatible models from the standard Hugging Face Hub cache.
ru: Находить MLX-совместимые модели в стандартном кэше Hugging Face Hub.
zh_hans: 从标准 Hugging Face Hub 缓存发现 MLX 兼容模型。

# server.row.listen_address
source: Listen Address
ru: Адрес прослушивания
zh_hans: 监听地址

# server.row.log_level
source: Log Level
ru: Уровень логирования
zh_hans: 日志级别

# server.row.models_directories
source: Model Directories
ru: Каталоги моделей
zh_hans: 模型目录

# server.row.models_directories.sub
source: The first path is the download target. All paths are scanned for local models.
ru: Первый путь — цель скачивания. Все пути сканируются на локальные модели.
zh_hans: 第一个路径是下载目标。所有路径均扫描本地模型。

# server.row.models_directory
source: Models Directory
ru: Каталог моделей
zh_hans: 模型目录

# server.row.models_directory.sub
source: Where the server reads and writes model weights. Downloaded models land here.
ru: Откуда сервер читает и куда записывает веса моделей. Скачанные модели попадают сюда.
zh_hans: 服务器读取和写入模型权重的位置。下载的模型存储在此处。

# server.row.port
source: Port
ru: Порт
zh_hans: 端口

# server.row.port.sub
source: Default 8000. Server restarts on save.
ru: По умолчанию 8000. При сохранении сервер перезапускается.
zh_hans: 默认 8000。服务器在保存时重启。

# server.section.advanced
source: Advanced
ru: Дополнительно
zh_hans: 高级

# server.section.default_profile
source: Default Profile
ru: Профиль по умолчанию
zh_hans: 默认配置文件

# server.section.default_profile.sub
source: Fallback values used when a model has no profile, or when a profile leaves a field empty
ru: Fallback-значения, используемые, когда у модели нет профиля или профиль оставляет поле пустым
zh_hans: 当模型没有配置文件，或配置文件留下空字段时使用的回退值

# server.section.endpoints
source: API Endpoints
ru: Эндпоинты API
zh_hans: API 端点

# server.section.logging
source: Logging
ru: Логирование
zh_hans: 日志

# server.section.network
source: Network
ru: Сеть
zh_hans: 网络

# server.section.startup
source: Server Startup
ru: Запуск сервера
zh_hans: 服务器启动

# server.section.usage
source: Usage History
ru: История использования
zh_hans: 使用历史

# server.row.usage_history
source: Record usage history
ru: Записывать историю использования
zh_hans: 记录使用历史

# server.row.usage_history.sub
source: Stores hourly per-model token totals in usage.sqlite3. Turning this off keeps existing history.
ru: Сохраняет почасовые итоги токенов по моделям в usage.sqlite3. При отключении существующая история сохраняется.
zh_hans: 在 usage.sqlite3 中存储各模型每小时的 Token 总量。关闭后会保留现有历史。

# server.section.storage
source: Storage
ru: Хранилище
zh_hans: 存储

# server.section.storage.sub
source: Where models, settings, logs, and the SSD cache live.
ru: Где находятся модели, настройки, логи и SSD-кэш.
zh_hans: 模型、设置、日志和 SSD 缓存的存放位置。

# settings.acceleration.mtp.sub
source: Drafts several tokens per step with the model's built-in MTP head. Up to ~1.5x faster decoding for supported models.
ru: Формирует несколько черновых токенов за шаг с помощью встроенной MTP-головы модели. До ~1.5× быстрее декодирование для поддерживаемых моделей.
zh_hans: 使用模型内置的 MTP 头，每步生成多个 Token。支持的模型解码速度最高可提升约 1.5 倍。

# settings.acceleration.section
source: Acceleration
ru: Ускорение
zh_hans: 加速

# settings.acceleration.subtitle
source: Decoding speedups for models that support them.
ru: Ускорение декодирования для моделей, которые его поддерживают.
zh_hans: 为支持加速的模型提供解码速度提升。

# settings.advanced.chat_template.add_custom
source: custom…
ru: пользовательский…
zh_hans: 自定义…

# settings.advanced.chat_template.add_kwarg
source: Add kwarg
ru: Добавить kwarg
zh_hans: 添加参数

# settings.advanced.chat_template.empty
source: No chat-template kwargs.
ru: Chat-template kwargs не настроены.
zh_hans: 没有聊天模板参数。

# settings.advanced.chat_template.force
source: Force
ru: Принудительно
zh_hans: 强制

# settings.advanced.chat_template.force.help
source: Add this key to forced_ct_kwargs so the request body can't override it.
ru: Добавить этот ключ в forced_ct_kwargs, чтобы тело запроса не могло его переопределить.
zh_hans: 将此键添加到 forced_ct_kwargs，防止请求体覆盖。

# settings.advanced.chat_template.key_placeholder
source: key
ru: ключ
zh_hans: 键

# settings.advanced.chat_template.reasoning_effort.custom
source: Custom
ru: Пользовательское
zh_hans: 自定义

# settings.advanced.chat_template.remove
source: Remove kwarg
ru: Удалить kwarg
zh_hans: 删除参数

# settings.advanced.chat_template.section
source: Chat Template Kwargs
ru: Аргументы chat template
zh_hans: 聊天模板参数

# settings.advanced.chat_template.subtitle
source: Forwarded to the model's chat template. Toggle Force to override per-request values.
ru: Передается в chat template модели. Включите Force, чтобы переопределять значения из запросов.
zh_hans: 转发到模型的聊天模板。切换"强制"以覆盖每次请求的值。

# settings.advanced.chat_template.value_placeholder
source: value
ru: значение
zh_hans: 值

# settings.advanced.enable_thinking.label
source: Enable Thinking
ru: Включить thinking
zh_hans: 启用思考

# settings.advanced.enable_thinking.sub
source: Enable reasoning/thinking mode for this model
ru: Включить режим reasoning/thinking для этой модели
zh_hans: 为此模型启用推理/思考模式

# settings.advanced.experimental.section
source: Experimental
ru: Экспериментальное
zh_hans: 实验性

# settings.advanced.experimental.subtitle
source: Speculative decoding, KV-cache quantization, and other research features.
ru: Спекулятивное декодирование, квантование KV-кэша и другие исследовательские функции.
zh_hans: 推测性解码、KV 缓存量化及其他研究功能。

# settings.advanced.force_sampling.label
source: Force Sampling
ru: Принудительное сэмплирование
zh_hans: 强制采样

# settings.advanced.force_sampling.sub
source: Override request sampling parameters with configured values
ru: Переопределять параметры сэмплирования из запросов настроенными значениями
zh_hans: 使用配置的值覆盖请求的采样参数

# settings.advanced.pin_memory.label
source: Pin in memory
ru: Закрепить в памяти
zh_hans: 固定在内存中

# settings.advanced.pin_memory.sub
source: Keep this model resident between requests
ru: Держать эту модель resident между запросами
zh_hans: 在请求之间保持此模型驻留

# settings.advanced.reasoning_parser.label
source: Reasoning Parser
ru: Парсер рассуждений
zh_hans: 推理解析器

# settings.advanced.reasoning_parser.sub
source: Override the chain-of-thought parser. Leave empty to use the model's default.
ru: Переопределяет парсер chain-of-thought. Оставьте пустым, чтобы использовать значение модели по умолчанию.
zh_hans: 覆盖思维链解析器。留空则使用模型默认值。

# settings.advanced.section
source: Advanced Settings
ru: Дополнительные настройки
zh_hans: 高级设置

# settings.advanced.thinking_budget.label
source: Thinking Budget
ru: Бюджет thinking
zh_hans: 思考预算

# settings.advanced.thinking_budget.sub
source: Limit thinking tokens for reasoning models. Forces end of thinking when exceeded.
ru: Ограничить thinking-токены для reasoning-моделей. Принудительно завершает thinking при превышении.
zh_hans: 限制推理模型的思考 Token 数。超出时强制结束思考。

# settings.advanced.tool_result_limit.label
source: Limit Tool Result Tokens
ru: Лимит токенов результата инструмента
zh_hans: 限制工具结果 Token

# settings.advanced.tool_result_limit.sub
source: Truncate large tool results (e.g. file reads) to a token limit
ru: Обрезать большие результаты инструментов (например чтение файлов) до лимита токенов
zh_hans: 将大型工具结果（如文件读取）截断至 Token 限制

# settings.advanced.trust_remote_code.label
source: Trust Remote Code
ru: Доверять удаленному коду
zh_hans: 信任远程代码

# settings.advanced.trust_remote_code.sub
source: Execute HuggingFace custom model code. Only enable for models you trust. Per-model only — never inherited from profiles.
ru: Выполнять пользовательский код моделей HuggingFace. Включайте только для моделей, которым доверяете. Только для модели — никогда не наследуется из профилей.
zh_hans: 执行 HuggingFace 自定义模型代码。仅对你信任的模型启用。仅限每模型 — 不会从配置文件继承。

# settings.basic.alias.label
source: Model Alias
ru: Псевдоним модели
zh_hans: 模型别名

# settings.basic.alias.sub
source: Falls back to the model id
ru: Если пусто, используется ID модели
zh_hans: 回退到模型 ID

# settings.basic.context_window.label
source: Context Window
ru: Окно контекста
zh_hans: 上下文窗口

# settings.basic.context_window.sub
source: Maximum tokens per request
ru: Максимум токенов на запрос
zh_hans: 每个请求的最大 Token 数

# settings.basic.max_tokens.label
source: Max Tokens
ru: Максимум токенов
zh_hans: 最大 Token 数

# settings.basic.max_tokens.placeholder
source: Default
ru: По умолчанию
zh_hans: 默认

# settings.basic.max_tokens.sub
source: Cap on generated tokens (empty = default)
ru: Лимит сгенерированных токенов (пусто = значение по умолчанию)
zh_hans: 生成 Token 的上限（空 = 默认）

# settings.basic.min_p.sub
source: Minimum probability floor (0 ≤ p ≤ 1).
ru: Минимальный порог вероятности (0 ≤ p ≤ 1).
zh_hans: 最小概率下限（0 ≤ p ≤ 1）。

# settings.basic.model_type.label
source: Model Type
ru: Тип модели
zh_hans: 模型类型

# settings.basic.presence_penalty.label
source: Presence Penalty
ru: Presence-штраф
zh_hans: 存在惩罚

# settings.basic.presence_penalty.sub
source: Penalize tokens already present (−2 to 2).
ru: Штрафовать уже присутствующие токены (−2 до 2).
zh_hans: 惩罚已存在的 Token（-2 到 2）。

# settings.basic.repetition_penalty.label
source: Repetition Penalty
ru: Repetition-штраф
zh_hans: 重复惩罚

# settings.basic.repetition_penalty.sub
source: Penalize repeated tokens (−2 to 2).
ru: Штрафовать повторяющиеся токены (−2 до 2).
zh_hans: 惩罚重复的 Token（-2 到 2）。

# settings.basic.section
source: Basic Settings
ru: Базовые настройки
zh_hans: 基本设置

# settings.basic.temperature.label
source: Temperature
ru: Температура
zh_hans: 温度

# settings.basic.temperature.sub
source: Sampling randomness (≥ 0). 0 = deterministic.
ru: Случайность сэмплирования (≥ 0). 0 = детерминированно.
zh_hans: 采样随机性（≥ 0）。0 = 确定性。

# settings.basic.top_k.sub
source: Limit candidates to top K (positive integer).
ru: Ограничить кандидаты top K (положительное целое).
zh_hans: 将候选限制为 Top K（正整数）。

# settings.basic.top_p.sub
source: Nucleus sampling cutoff (0 < p ≤ 1).
ru: Порог nucleus sampling (0 < p ≤ 1).
zh_hans: 核采样截断（0 < p ≤ 1）。

# settings.basic.ttl.placeholder
source: No TTL
ru: Без TTL
zh_hans: 无 TTL

# settings.basic.ttl.sub
source: Seconds before idle unload (empty = no TTL)
ru: Секунд до выгрузки при простое (пусто = без TTL)
zh_hans: 空闲卸载前的秒数（空 = 无 TTL）

# settings.dflash.quant.4bit
source: 4-bit
ru: 4-бит
zh_hans: 4 位

# settings.dflash.quant.8bit
source: 8-bit
ru: 8-бит
zh_hans: 8 位

# settings.dflash.quant.activation.16
source: 16-bit
ru: 16-бит
zh_hans: 16 位

# settings.dflash.quant.activation.32
source: 32-bit
ru: 32-бит
zh_hans: 32 位

# settings.dflash.quant.activation.default
source: default
ru: по умолчанию
zh_hans: 默认

# settings.dflash.quant.bf16
source: bf16 (default)
ru: bf16 (по умолчанию)
zh_hans: bf16（默认）

# settings.dflash.quant.group.default
source: default
ru: по умолчанию
zh_hans: 默认

# settings.dflash.quant.weight.2
source: 2-bit
ru: 2-бит
zh_hans: 2 位

# settings.dflash.quant.weight.4
source: 4-bit
ru: 4-бит
zh_hans: 4 位

# settings.dflash.quant.weight.8
source: 8-bit
ru: 8-бит
zh_hans: 8 位

# settings.dflash.verify_mode.adaptive
source: adaptive
ru: адаптивный
zh_hans: 自适应

# settings.dflash.verify_mode.default
source: default (adaptive)
ru: по умолчанию (адаптивный)
zh_hans: 默认（自适应）

# settings.dflash.verify_mode.off
source: off
ru: выкл.
zh_hans: 关闭

# settings.draft_model.placeholder
source: Select draft model…
ru: Выберите draft-модель…
zh_hans: 选择草稿模型…

# settings.experimental.dflash.draft_quant_activation.label
source: Activation Bits
ru: Биты активации
zh_hans: 激活位宽

# settings.experimental.dflash.draft_quant_group.label
source: Group Size
ru: Размер группы
zh_hans: 分组大小

# settings.experimental.dflash.draft_quant_weight.label
source: Weight Bits
ru: Биты весов
zh_hans: 权重位宽

# settings.experimental.dflash.draft_quant.label
source: Draft Quantization
ru: Квантование draft-модели
zh_hans: 草稿量化

# settings.experimental.dflash.draft_quant.sub
source: Enable quantization for the draft model (weight, activation bits & group size).
ru: Включить квантование draft-модели (биты весов, активаций и размер группы).
zh_hans: 为草稿模型启用量化（权重位宽、激活位宽和分组大小）。

# settings.experimental.dflash.draft.label
source: DFlash Draft Model
ru: Draft-модель DFlash
zh_hans: DFlash 草稿模型

# settings.experimental.dflash.max_ctx.label
source: Max Context (fallback)
ru: Макс. контекст (fallback)
zh_hans: 最大上下文（回退）

# settings.experimental.dflash.max_ctx.placeholder
source: unlimited
ru: без ограничения
zh_hans: 无限制

# settings.experimental.dflash.max_ctx.sub
source: Prompts at or above this token count switch to BatchedEngine. Empty = unlimited.
ru: Промпты с этим числом токенов или выше переключаются на BatchedEngine. Пусто = без ограничения.
zh_hans: Token 数达到或超过此值的提示将切换到 BatchedEngine。空 = 无限制。

# settings.experimental.dflash.mem_cache_entries.label
source: Cache Entries
ru: Записи кэша
zh_hans: 缓存条目

# settings.experimental.dflash.mem_cache_entries.sub
source: Maximum prefix snapshots kept in RAM. Each entry stores KV + draft GDN state.
ru: Максимум префиксных снимков в оперативной памяти. Каждая запись хранит KV и состояние draft GDN.
zh_hans: 保留在 RAM 中的最大前缀快照数。每个条目存储 KV + 草稿 GDN 状态。

# settings.experimental.dflash.mem_cache.label
source: DFlash in-memory cache
ru: Кэш DFlash в памяти
zh_hans: DFlash 内存缓存

# settings.experimental.dflash.mem_cache.sub
source: DFlash L1 prefix snapshot cache in RAM.
ru: L1-кэш префиксных снимков DFlash в оперативной памяти.
zh_hans: RAM 中的 DFlash L1 前缀快照缓存。

# settings.experimental.dflash.sink_size.label
source: Draft Sink Size
ru: Размер attention sink
zh_hans: 草稿 Sink 大小

# settings.experimental.dflash.sink_size.sub
source: Attention-sink tokens always kept in the window. Empty = dflash default (0).
ru: Attention-sink-токены всегда остаются в окне. Пусто = значение DFlash по умолчанию (0).
zh_hans: 注意力 sink Token 始终保留在窗口中。空 = dflash 默认（0）。

# settings.experimental.dflash.ssd_cache_size.label
source: SSD Cache Size
ru: Размер SSD-кэша
zh_hans: SSD 缓存大小

# settings.experimental.dflash.ssd_cache_size.sub
source: Disk budget for L2 spill; oldest entries are evicted when exceeded.
ru: Дисковый бюджет для L2 spill; самые старые записи удаляются при превышении.
zh_hans: L2 溢出的磁盘预算；超出时驱逐最旧的条目。

# settings.experimental.dflash.ssd_cache.label
source: DFlash SSD cache
ru: SSD-кэш DFlash
zh_hans: DFlash SSD 缓存

# settings.experimental.dflash.ssd_cache.sub
source: L2 spill of evicted L1 entries to disk.
ru: L2-хранилище для вытесненных L1-записей на диске.
zh_hans: 被驱逐的 L1 条目溢出到磁盘的 L2。

# settings.experimental.dflash.ssd_cache.sub.needs_l1
source: Requires the in-memory cache to be enabled.
ru: Требует включенного кэша в памяти.
zh_hans: 需要启用内存缓存。

# settings.experimental.dflash.ssd_cache.sub.unavailable
source: Enable the global paged SSD cache directory first.
ru: Сначала включите глобальный каталог paged SSD-кэша.
zh_hans: 请先启用全局分页 SSD 缓存目录。

# settings.experimental.dflash.sub
source: Block-diffusion speculative decoding. Single-stream only (requests run one at a time).
ru: Block-diffusion speculative decoding. Только single-stream (запросы выполняются по одному).
zh_hans: 块扩散推测性解码。仅单流（请求逐个运行）。

# settings.experimental.dflash.verify_mode.label
source: Verify Mode
ru: Режим верификатора
zh_hans: 验证模式

# settings.experimental.dflash.verify_mode.sub
source: Verifier algorithm. "adaptive" shrinks block size when acceptance drops; "off" disables speculative verify.
ru: Алгоритм верификатора. "adaptive" уменьшает размер блока при снижении доли принятых токенов; "off" отключает спекулятивную проверку.
zh_hans: 验证器算法。“自适应”在接受率下降时缩小块大小；“关闭”禁用推测验证。

# settings.experimental.dflash.window_size.label
source: Draft Window Size
ru: Размер draft-окна
zh_hans: 草稿窗口大小

# settings.experimental.dflash.window_size.sub
source: Draft model sliding-attention window. Empty = dflash default (2048).
ru: Sliding-attention-окно draft-модели. Пусто = значение DFlash по умолчанию (2048).
zh_hans: 草稿模型滑动注意力窗口。空 = dflash 默认（2048）。

# settings.experimental.indexcache.sub
source: Sparse attention index cache for DSA models. THUDM/IndexCache.
ru: Sparse attention index cache для DSA-моделей. THUDM/IndexCache.
zh_hans: DSA 模型的稀疏注意力索引缓存。THUDM/IndexCache。

# settings.experimental.specprefill.draft.label
source: Draft Model
ru: Draft-модель
zh_hans: 草稿模型

# settings.experimental.specprefill.draft.sub
source: Small model sharing tokenizer with target.
ru: Малая модель с общим tokenizer с целевой.
zh_hans: 与目标共享分词器的小型模型。

# settings.experimental.specprefill.keep_rate.label
source: Keep Rate
ru: Доля сохранения
zh_hans: 保留率

# settings.experimental.specprefill.sub
source: Attention-based sparse prefill for MoE/hybrid models.
ru: Разреженный префилл на основе attention для MoE- и гибридных моделей.
zh_hans: 基于注意力的 MoE/混合模型稀疏预填充。

# settings.experimental.specprefill.threshold.label
source: Threshold
ru: Порог
zh_hans: 阈值

# settings.experimental.specprefill.threshold.sub
source: Min prompt tokens to trigger (shorter prompts use full prefill).
ru: Минимум токенов промпта для срабатывания (короткие промпты используют полный префилл).
zh_hans: 触发的最小提示 Token 数（较短的提示使用完整预填充）。

# settings.experimental.turboquant.label
source: TurboQuant KV Cache
ru: KV-кэш TurboQuant
zh_hans: TurboQuant KV 缓存

# settings.experimental.turboquant.sub
source: Quantize the KV cache during prefill. Saves memory at a small quality cost.
ru: Квантовать KV-кэш во время префилла. Экономит память с небольшой потерей качества.
zh_hans: 在预填充期间量化 KV 缓存。以微小的质量代价节省内存。

# settings.experimental.vlm_mtp.block_size.label
source: Draft Block Size
ru: Размер draft-блока
zh_hans: 草稿块大小

# settings.experimental.vlm_mtp.block_size.sub
source: Tokens drafted per round. Empty uses the mlx-vlm default.
ru: Количество draft-токенов за раунд. Пусто = значение mlx-vlm по умолчанию.
zh_hans: 每轮起草的 Token 数。空使用 mlx-vlm 默认值。

# settings.experimental.vlm_mtp.draft.label
source: VLM Draft Model
ru: VLM draft-модель
zh_hans: VLM 草稿模型

# settings.experimental.vlm_mtp.draft.sub
source: Assistant drafter sharing the target's tokenizer.
ru: Assistant drafter с tokenizer целевой модели.
zh_hans: 共享目标分词器的助手起草器。

# settings.experimental.vlm_mtp.sub
source: Multi-token prediction for vision-language models via an assistant drafter.
ru: Multi-token prediction для vision-language моделей через assistant drafter.
zh_hans: 通过助手起草器为视觉语言模型进行多 Token 预测。

# settings.header.back_to_models
source: Back to Models
ru: Назад к моделям
zh_hans: 返回模型

# settings.model_type.auto_detect
source: Auto-detect
ru: Автоопределение
zh_hans: 自动检测

# settings.model_type.embed
source: Embedding
ru: Эмбеддинги
zh_hans: 嵌入

# settings.model_type.rerank
source: Reranker
ru: Реранкер
zh_hans: 重排序

# settings.mtp.conflict.dflash
source: Disable DFlash before enabling MTP.
ru: Отключите DFlash перед включением MTP.
zh_hans: 启用 MTP 前禁用 DFlash。

# settings.mtp.conflict.turboquant
source: Disable TurboQuant KV before enabling MTP.
ru: Отключите TurboQuant KV перед включением MTP.
zh_hans: 启用 MTP 前禁用 TurboQuant KV。

# settings.mtp.conflict.vlm_mtp
source: Disable VLM MTP before enabling Lightning MTP.
ru: Отключите VLM MTP перед включением Lightning MTP.
zh_hans: 启用 Lightning MTP 前禁用 VLM MTP。

# settings.profiles.edit_on_server
source: Edit on Server →
ru: Изменить на сервере →
zh_hans: 在服务器上编辑 →

# settings.profiles.global.label
source: Global Profiles
ru: Глобальные профили
zh_hans: 全局配置文件

# settings.profiles.model.label
source: Model Profiles · %@
ru: Профили модели · %@
zh_hans: 模型配置文件 · %@

# settings.profiles.no_profile.name
source: No profile
ru: Нет профиля
zh_hans: 无配置文件

# settings.profiles.preset.label
source: Preset Profiles
ru: Профили-пресеты
zh_hans: 预设配置文件

# settings.profiles.server_default.name
source: Server Default Profile
ru: Серверный профиль по умолчанию
zh_hans: 服务器默认配置文件

# settings.profiles.server_defaults.subtitle
source: Used when no profile is set, or when a profile leaves a field empty
ru: Используется, когда профиль не задан или профиль оставляет поле пустым
zh_hans: 未设置配置文件或配置文件字段留空时使用

# settings.profiles.server_defaults.title
source: Server Defaults
ru: Значения сервера по умолчанию
zh_hans: 服务器默认值

# settings.profiles.working.name
source: Working profile
ru: Рабочий профиль
zh_hans: 工作配置文件

# settings.section.advanced
source: Advanced
ru: Дополнительно
zh_hans: 高级

# settings.section.basic
source: Basic
ru: Базовые
zh_hans: 基本

# settings.section.profiles
source: Profiles
ru: Профили
zh_hans: 配置档

# settings.specprefill.keep.10
source: 10% — Aggressive (~5-7x, some quality loss)
ru: 10% — агрессивно (~5-7×, возможна потеря качества)
zh_hans: 10% — 激进（约 5-7 倍，有一定质量损失）

# settings.specprefill.keep.20
source: 20% — Balanced (~3x, recommended)
ru: 20% — сбалансированно (~3×, рекомендуется)
zh_hans: 20% — 均衡（约 3 倍，推荐）

# settings.specprefill.keep.25
source: 25% — Conservative+ (~2.5x)
ru: 25% — консервативно+ (~2,5×)
zh_hans: 25% — 较保守（约 2.5 倍）

# settings.specprefill.keep.30
source: 30% — Conservative (~2.2x)
ru: 30% — консервативно (~2,2×)
zh_hans: 30% — 保守（约 2.2 倍）

# settings.specprefill.keep.40
source: 40% — Mild (~1.8x)
ru: 40% — мягко (~1,8×)
zh_hans: 40% — 温和（约 1.8 倍）

# settings.specprefill.keep.50
source: 50% — Minimal (~1.5x)
ru: 50% — минимально (~1,5×)
zh_hans: 50% — 最小（约 1.5 倍）

# settings.speculative.conflict.vlm_mtp
source: Disable VLM MTP before enabling this feature.
ru: Отключите VLM MTP перед включением этой функции.
zh_hans: 启用此功能前禁用 VLM MTP。

# settings.turboquant.bits.2
source: 2-bit
ru: 2-бит
zh_hans: 2 位

# settings.turboquant.bits.2_5
source: 2.5-bit
ru: 2.5-бит
zh_hans: 2.5 位

# settings.turboquant.bits.3
source: 3-bit
ru: 3-бит
zh_hans: 3 位

# settings.turboquant.bits.3_5
source: 3.5-bit
ru: 3.5-бит
zh_hans: 3.5 位
